[
    {
      "id": "1",
      "name": "Smith",
      "comment": "I was in a bind with my old vehicle. Wesley Egerton at Winners Circle Nissan of Hampton was very helpful in getting me back on the road. He assessed my car needs and responded quickly and efficiently. I didn't feel rushed to make a decision. Wesley made the process easy by making sure everything was taken care of before I left. Thanks so much for the awesome service. I highly recommend.",
      "ratings": "4/5"
    },
    {
      "id": "2",
      "name": "Barron David",
      "comment": "Reached out to cars.com regarding a listing they have. Advised them that the price they have listed is $10k lower than the dealership. MEGAN, told me that sometimes there are errors and that I would need to contact the dealer for correct pricing, HOWEVER never said cars.com would address the issue with the dealership and have it corrected. Seems a little strange that they would allow wrong information to sit on their site. Bad business practice!",
      "ratings": "5/5"
    },
    {
      "id": "3",
      "name": "Gough Muel",
      "comment": "Just want everyone to know how Romano Toyota treats people. This was my baby she was my lease and in no way was I wanting to give her up at the end. When I leased her three years ago I was told yes you can buy her out at the end and we will help you... Three years later me taking care of my vehicle because she would be my forever... Not only was I emotionally attached to this car for many reasons I loved her... I go in to buyout my Rav to be told nope we don't do that anymore.",
      "ratings": "5/5"
    },
    {
      "id": "4",
      "name": "Michael",
      "comment": "I very rarely write reviews, but this is a special case. Nikki Elmore made our Freehold Hyundai dealership experience very enjoyable. She helped us every step of the way, answered all of our questions, she was knowledgeable and patient while we went through several choices to decide on the car we wanted, and she never put any pressure on us. In helping us to get the car we wanted Nikki went above and beyond. The dealership did not have the Kona which we wanted, so Nikki wasn't just pushing a car on the lot for us to buy regardless if it was the same model or color. ",
      "ratings": "3/5"
    },
    {
      "id": "5",
      "name": "Emery",
      "comment": "Reliable, is easy to drive, includes updated features and safety features. Adequate space. I have been Driving Toyota Corolla for many years and have been very satisfied. My next car will be a Corolla.",
      "ratings": "5/5"
    },
    {
      "id": "6",
      "name": "Alfred",
      "comment": "I was not able to make payments so they took the car. Then after they sold the car there was a balance of $4,689.28 which I was not aware of. 2019 comes in and they hired Rubin and Rothman law firm and this law firm of crooks is trying to charge me $11133.56 with interest fees and according to Toyota interest fees are never charged on a closed account. Shame on YOU Toyota!!! For not doing your due diligence and hiring a bunch of THUGS to misrepresent YOU!",
      "ratings": "4/5"
    }
]